'''
Програма робить запит на перше і друге число, переводить відповіді в числа, 
перемножує їх і друкує результат. Не потрібно друкувати ніяких слів - тільки число, 
яке вийде.
'''
# Запит на введення першого числа
num1_str = input("Введіть перше число: ")

# Запит на введення другого числа
num2_str = input("Введіть друге число: ")

# Перетворення введених значень у числа (int)
num1 = int(num1_str)
num2 = int(num2_str)

# Множення двох чисел
result = num1 * num2

# Друк результату
print(result)

