'''

#TODO Напишіть будь-яку програму.
Можна друкувати якусь історію, діалог, можна малювати малюнки за допомогою зірочок та інших символів. 

Зробіть те, що Вам цікаво — головне, щоб ця програма працювала!

'''
# Програма "Ласкаво просимо до магічного світу"

print("Ласкаво просимо до магічного світу!")
print("Тут ваші найзаповітніші мрії можуть стати реальністю.")

# Запитайте користувача про його бажання
wish = input("Яку магічну мрію ви хочете здійснити? ")

# Роздрукуйте повідомлення про те, що мрія буде здійснена
print(f"Ваша магічна мрія '{wish}' невдовзі здійсниться!")

# Додайте елементи фантазії для задоволення користувача
print("У цьому світі можливостей безліч. Зустріньте чарівних казкових персонажів та відкрийте таємниці.")
print("Бажаємо вам приголомшливих подорожей у магічному світі!")

# Закінчимо привітанням
print("До побачення в магічному світі!")


