'''
Створіть    програму  , яка зчитує від користувача два цілих числа, a і b. 
Ваша програма повинна обчислювати та відображати:

1.	Сума a і b
2.	Різницю при відніманні b  від  a
3.	Добуток a і b
4.	Цілочисельне, коли a ділиться на b      (7 розділити на 2 рівне 3)
5.	Залишок при діленні a на b              (7 розділити на 2 рівне 1)
6.	Результат Log10 a
7.	Результат a в степені b

'''
import math

# Зчитати два цілих числа від користувача
a = int(input("Введіть ціле число a: "))
b = int(input("Введіть ціле число b: "))

# Обчислення та виведення результатів
print(f"1. Сума a і b: {a + b}")
print(f"2. Різниця a і b: {a - b}")
print(f"3. Добуток a і b: {a * b}")
print(f"4. Цілочисельне ділення a на b: {a // b}")
print(f"5. Залишок при діленні a на b: {a % b}")
print(f"6. Результат Log10 a: {math.log10(a)}")
print(f"7. Результат a в степені b: {a ** b}")
