'''
У Сполучених Штатах паливна ефективність для транспортних засобів 
зазвичай виражається в милях на галон (MPG). 
У Канаді паливна економічність зазвичай виражається 
в літрах на сто кілометрів (л/100 км). 
Використовуйте свої дослідницькі навички,
щоб визначити, як перетворити з MPG на L/100 км. 
Потім створіть програму, яка зчитує значення від користувача 
в американських одиницях і відображає еквівалентну паливну 
ефективність в канадських одиницях.

'''
# Зчитати значення MPG від користувача
mpg = float(input("Введіть значення паливної ефективності в MPG: "))

# Виконати перетворення з MPG в л/100 км
liters_per_100km = 235.214 / mpg

# Вивести результат
print(f"Еквівалентна паливна ефективність в л/100 км: {liters_per_100km:.2f} л/100 км")
