'''
Збережіть програму як модуль, вона знадобиться нам в наступному завданні.
Перед Вами програма, яка переводить годинни і хвилини в секунди.
Збережіть її як модуль, вона нам знадобиться в наступному завданні!
'''

# time_conversion.py

# Функція для переведення хвилин у секунди
# Вхідні параметри: m - кількість секунд
# Повернене значення: кількість секунд у хвилинах
def seconds_in_min(m):
    return m * 60

# Функція для переведення годин у секунди
# Вхідні параметри: h - кількість годин
# Повернене значення: кількість секунд у годинах
def seconds_in_hour(h):
    return h * 3600
