'''
Створіть модуль olympic і функцію run, яка по пройденій відстані 
і витраченому часу допоможе спортсмену дізнатися його швидкість.
На змаганнях з бігу відома дистанція, 
яку пробігає спортсмен, і засікається час. 
Учаснику важливо розуміти, з якою середньою швидкістю він рухався, 
щоб відстежувати свої результати. 
Давайте напишемо програму, яка йому в цьому допоможе.
Напишіть функцію run (s, t), яка повертає швидкість 
спортсмена (s - це відстань, а t - це час). 
Збережі програму як модуль olympic.
'''

# Напиши та збережи модуль olympic
# olympic.py

# Функція для обчислення швидкості спортсмена
# Вхідні параметри: s - відстань, t - час
# Повернене значення: швидкість спортсмена
def run(s, t):
    return s / t
# main_program.py

from olympic import run

distance = float(input("Введіть відстань, яку пробіг спортсмен (у кілометрах): "))
time = float(input("Введіть час, який засікли за його пробіг (у годинах): "))

speed = run(distance, time)

print(f"Швидкість спортсмена: {speed} км/год")
