'''
Напишіть програму, яка три рази задає питання і 
три рази каже однакові фрази на відповіді «так» і «ні».
Приклади питань написані в програмі нагорі. 
Відповіді повинні бути або "Чудово! 
Ви талант!" (На відповідь "так") або 
"Ви можете навчитися, якщо захочете!"
'''

# Поставте три питання, наприклад:
# "Ви вмієте грати на піаніно?"
# "Ви вмієте грати в футбол?"
# "Ви вмієте кататися на скейті?"
# запам'ятовуйте відповіді в змінну:
# Answer = input ()

# Поставте три питання
question1 = "Ви вмієте грати на піаніно?"
question2 = "Ви вмієте грати в футбол?"
question3 = "Ви вмієте кататися на скейті?"

# Запитайте користувача тричі і запам'ятайте відповіді
answer1 = input(question1)
answer2 = input(question2)
answer3 = input(question3)

# Перевірте відповіді і надайте відповідні коментарі
if answer1 == "так":
    print("Чудово! Ти талант!")
else:
    print("Ти можеш навчитися, якщо захочеш!")

if answer2 == "так":
    print("Чудово! Ти талант!")
else:
    print("Ти можеш навчитися, якщо захочеш!")

if answer3 == "так":
    print("Чудово! Ти талант!")
else:
    print("Ти можеш навчитися, якщо захочеш!")
