'''
Запросіть два числа a і b. 
Виведіть площу прямокутника із заданими сторонами в форматі, 
який вказаний в прикладі. 
Формула знаходження площі прямокутника: S = a * b. 
Приклад виводу результата S = 20, звертайте увагу на відступи між символами.
'''
# Запит користувача для введення значень сторін прямокутника
a = float(input("Введіть довжину прямокутника (a): "))
b = float(input("Введіть ширину прямокутника (b): "))

# Обчислення площі прямокутника
area = a * b

# Виведення результату в форматі "S = <значення площі>"
print("S =", area)
