'''
Запросіть три числа a, b і с. 
Виведіть об'єм прямокутного паралелепіпеда з заданими сторонами в форматі, 
який вказаний в прикладі. 
Формула знаходження об'єму прямокутного паралелепіпеда: 
V = a * b * c
'''
# Запит користувача для введення значень сторін прямокутного паралелепіпеда
a = float(input("Введіть довжину прямокутного паралелепіпеда (a): "))
b = float(input("Введіть ширину прямокутного паралелепіпеда (b): "))
c = float(input("Введіть висоту прямокутного паралелепіпеда (c): "))

# Обчислення об'єму прямокутного паралелепіпеда
volume = a * b * c

# Виведення результату в форматі "V = <значення об'єму>"
print("V =", volume)
