'''
Написати функцію season, що приймає 1 параметр - номер місяця (від 1 до 12), 
і повертає час року, до якого цей місяць належить (зима, весна, літо або осінь).
Програма, яка використовує функцію season вже написана. 
Вона запитує номер місяця і друкує потрібний рядок. 
Наприклад, "Це - літо.". 
Додайте в потрібне місце визначення функції season.
Функція отримує в якості свого параметра номер місяця. 
За допомогою декількох умовних операторів визначає, до якого часу року відноситься місяць. 
Після цього повертає (return) один з рядків: "зима", "весна", "літо", "осінь". 
Пори року пишуться маленькими літерами без розділових знаків.
'''

def season(month):
    if 1 <= month <= 2 or month == 12:
        return "зима"
    elif 3 <= month <= 5:
        return "весна"
    elif 6 <= month <= 8:
        return "літо"
    elif 9 <= month <= 11:
        return "осінь"

# Введення номера місяця
m = int(input("Введіть номер місяця вашого народження: "))

# Виведення результату
s = "Це - " + season(m) + "."
print(s)
