'''
Друк сум рядків
Допишіть програму
Програма повинна надрукувати спочатку рядок "Салам Алейкум" і потім другий рядок: "Алейкум Салам"
Використовуйте готові рядки a і b, які вже написані в програмі! Не видаляйте їх.

Вам потрібно два рази використовувати функцію print () - спочатку вона друкує об'єднання 
готових рядків в одному порядку, а потім в іншому.
'''
# Використовуйте функцію print() для надруку об'єднання готових рядків у різному порядку
a = "Салам "
b = "Алейкум "
print(a + "Алейкум")
print(b + "Салам")
