'''
!   Оператор циклу while

    Універсальним організатором циклу в мові програмування
Python є конструкція while [5, 6, 7, 8, 9, 11]. Слово "while" з
англійської мови перекладається як "поки" ("поки логічний вираз
повертає істину, виконувати певні операції"). Конструкцію while
на мові Python можна описати наступною схемою:

                while УМОВА_ПОВТОРЕННЯ_ЦИКЛУ:
                    ТІЛО_ЦИКЛУ
                    
    Дуже схоже на оператор умови – тільки тут використовується
інше ключове слово: while (англ. "Поки").

    Дану конструкцію як правило використовують при повторі
уведення даних користувачем, поки не буде отримано коректне
значення

    Ще один варіант використання оператора циклу –
обчислення формул із змінним параметром.

    E 𝑖^3 = 1^3 + ⋯ + 𝑛^3, при і = 1
    
    В даному випадку, параметром, що змінюються є i, причому i
послідовно приймає значення в діапазоні від 1 до n.

    За допомогою оператора циклу while рішення буде виглядати
так:

            n = int(input("Введіть n: "))
            sum = 0
            i = 1
            while i <= n:
                sum += i**3
                i += 1
            print ("sum = ", sum)
            
Результатом запуску даного коду буде:
            Введіть n: 5
            sum = 225

!   Нескінченні цикли
    
    Іноді можна зіткнулися з проблемою нескінченного
повторення блоку коду, що виникає, наприклад, через
семантичну помилку в програмі:
                        i = 0
                        while i < 10:
                            print (i)

    Такий цикл буде виконуватися нескінченно, тому що умова 
i<10 завжди буде істинною, адже значення змінної i не
змінюється: така програма буде виводити нескінченну
послідовність нулів.

    У циклів немає обмеження кількості повторень тіла циклу,
тому програма з нескінченним циклом буде працювати
безперервно, поки не буде зроблено аварійної зупинки
натисканням комбінації клавіш Ctrl+C, не зупинимо відповідний
процес засобами операційної системи, або не будуть вичерпані
доступні ресурси комп’ютера (наприклад, може бути досягнуто
максимально допустимої кількості відкритих файлів), чи не
виникне виняток. У таких ситуаціях кажуть, що
програма зациклилася.
    
    Знайти зациклення в програмі іноді буває не так-то просто,
адже в реальних програмах зазвичай використовується багато
циклів, кожен з яких потенційно може виконуватися нескінченно.

    Проте, відсутність обмеження на кількість повторів тіла
циклу дає нові можливості. Багато програм представляють собою
цикл, в тілі якого проводиться відстеження та оброблення дій
користувачів або запитів з інших програмних і автоматизованих
систем. При цьому такі програми можуть працювати без перебоїв
дуже тривалі терміни, іноді роками.
    
    Цикли – це дуже потужний засіб реалізації, але вони
вимагають деякої уважності.

Я   кщо необхідно, щоб цикл виконувався до тих пір, поки
щось не станеться, але точно не відомо, коли ця подія трапиться
можна скористатися нескінченним циклом, що містить
оператор break


!   Цикл for
    В Python ітератори часто використовуються оскільки вони
дозволяють проходити структури даних, не знаючи, наскільки ці
структури великі і як реалізовані. Можливо пройти по
послідовності таким чином:
                        numbers = [1, 2, 3, 4, 5]
                        i = 0
                        while i <=len(numbers)-1:
                            print(numbers[i])
                            i+=1

                        Результатом запуску даного коду буде:
                        1 
                        2 
                        3 
                        4 
                        5

    Однак існує більш характерний для Python спосіб вирішення
цього завдання:

                        for element in numbers:
                            print(element)
                            
    Списки подібні до numbers є одними з ітераційних об’єктів в
Python поряд з рядками, кортежами, словниками та деякими
іншими елементами.

!    Ітераційні об’єкти 
– це ті, вміст яких можна перебрати в
циклі. Ітерування по кортежу або списку повертає один елемент
за раз. Ітерування по рядку повертає один символ за раз.

    Цикл for дозволяє перебирати всі елементи вказаної
послідовності (список, кортеж, рядок). Цикл спрацює рівно
стільки разів, скільки елементів знаходиться в послідовності.

                        for ЗМІННА in ПОСЛІДОВНІСТЬ:
                            ТІЛО_ЦИКЛУ
                            
    Ім’я змінної в яку на кожному кроці буде розміщено елемент
послідовності обирається довільно.
    
    Оператори break та continue працюють так само як і в циклі
while. Блок else дозволяє перевірити чи виконався цикл for
повністю якщо ключове слово break не було викликане, то буде
виконаний блок else. Це корисно, якщо потрібно переконатися в
тому, що попередній цикл виконався повністю, замість того щоб
рано перерватися.
'''