'''
Програма повинна запитати пароль. 
Правильна відповідь - "друг" (всі букви маленькі). 
Якщо пароль вірний, програма друкує "Вірно! Проходьте на наше свято!". 
У разі неправильного пароля - друкує "Пароль не вірний! Карамба!"

Якими словами питати пароль, неважливо. 
А ось відповідати програма повинна обов'язково так, 
як вказано в завданні. Подивіться, в програмі вже заведені дві змінні, 
які можна використовувати для відповідей!
'''

yes = "Вірно! Проходь на наше свято!"
no = "Пароль не вірний! Карамба!"
