'''
Давай намалюємо будинок! 
Яку площу він займе?

Користувач вводить чотири числа: 
a і b - сторони прямокутника, 
c і d - висота і основа трикутника.
Визначте функцію home_area, 
яка поверне площу будинку 
(тобто суму площ прямокутника і трикутника).

'''
def home_area(a, b, c, d):
    # Площа прямокутника
    rectangle_area = a * b
    
    # Площа трикутника
    triangle_area = 0.5 * c * d
    
    # Площа будинку - сума площ прямокутника і трикутника
    total_area = rectangle_area + triangle_area
    
    return total_area

# Користувач вводить розміри будинку
a = int(input("Введіть першу сторону прямокутника: "))
b = int(input("Введіть другу сторону прямокутника: "))
c = int(input("Введіть висоту трикутника: "))
d = int(input("Введіть основу трикутника: "))

# Виводимо площу будинку на екран
print("Площа будинку:", home_area(a, b, c, d))


