'''
Користувач вводить чотиризначне число. 
Виведіть число, складене з тих самих цифр, 
записаних в зворотному порядку.
Рішення оформи у вигляді функції reverse (n), 
яка отримує на вхід введене користувачем число 
і повертає його перевертень.
'''
def reverse(n):
    # Перетворюємо число в рядок для зручності роботи з символами
    str_n = str(n)
    
    # Здійснюємо обернення рядка
    reversed_str = str_n[::-1]
    
    # Перетворюємо обернений рядок в ціле число
    reversed_num = int(reversed_str)
    
    return reversed_num

# Користувач вводить чотиризначне число
user_number = int(input("Введіть чотиризначне число: "))

# Виводимо результат на екран
print("Число в зворотному порядку:", reverse(user_number))
