'''
На Марс був відправлений шатл з вантажем. 
Частина коробок містить крихкі предмети 
і вимагає особливої обережності при перенесенні. 
Відомо, що номери таких коробок кратні трьом, 
а всього коробок n. 
Виведіть номери тих вантажів, 
з якими НЕ потрібно поводитися особливо акуратно.
Користувач вводить число n - число коробок. 
Програма повинна вивести всі числа від 1 до n, що не кратні 3.
'''
# Введення числа коробок від користувача
n = int(input("Введіть кількість коробок: "))

# Виведення номерів вантажів, з якими НЕ потрібно поводитися особливо акуратно
print("Номери вантажів, з якими НЕ потрібно особливо акуратно:")
for i in range(1, n + 1):
    if i % 3 != 0:
        print(i)

