'''
Програма повинна запитати, яку музику любить людина, 
і відповісти, що теж слухає таку музику. 
Обов'язково використовуйте формулювання 
"О, я теж слухаю <отриману відповідь>".
Наприклад, людина відповідає: "Бетховена". 
Програма друкує: "О, я теж слухаю Бетховена". 
Або людина відповідає: "гітару". 
Програма друкує: "О, я теж слухаю гітару".
'''

q = "Яку музику ти любиш?"
a = "О, я теж слухаю "
# Запитайте користувача, яку музику він любить
user_music = input("Яку музику ти любиш? ")

# Виведіть відповідь зі збереженою відповіддю
