'''
Напишіть калькулятор: програма отримує два числа 
і операцію, здійснює операцію і друкує результат.
Програма виконує такі операції: 
"+" - додавання, 
"-" - відняти від першого числа друге, 
"*" - помножити, 
"/" - розділити перше число на друге. 
Якщо введена якась інша операція, 
потрібно надрукувати рядок, який вказаний у змінній 
err1: "Помилка: невідома операція.
"Якщо введена операція ділення, і друге число дорівнює нулю, 
потрібно надрукувати рядок err2: "Помилка: ділити на нуль не можна."

'''

err1 = "Помилка: невідома операція."
err2 = "Помилка: ділити на нуль не можна."
# Запитайте користувача на введення двох чисел і операції
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
operation = input("Введіть операцію (+, -, *, /): ")

# Виконайте відповідну операцію і виведіть результат
if operation == "+":
    result = num1 + num2
elif operation == "-":
    result = num1 - num2
elif operation == "*":
    result = num1 * num2
elif operation == "/":
    if num2 == 0:
        print(err2)
        exit()
    else:
        result = num1 / num2
else:
    print(err1)
    exit()

# Виведіть результат
print("Результат: ", result)
