'''
Чат-бот запитує "Як справи?"
Використовуйте функцію input, щоб чат-бот сказав користувачеві: 
"Як справи?" і прочитав введену відповідь.

Навчіть чат-бота реагувати на Вашу відповідь.
Використовуйте print, щоб чат-бот відповів: "Буду знати, що <ваша відповідь>!".
Зверніть увагу на знак оклику в кінці фрази.
'''
def chat_bot():
    # Запитання про стан справ
    user_response = input("Як справи? ")

    # Відповідь чат-бота
    print(f"Буду знати, що {user_response}!")

# Виклик функції чат-бота
chat_bot()
