'''
Своє вітання
Тепер Ви можете придумати своє вітання для чат-бота!

Скопіюйте дві попередні написані програми.
Змініть репліки чат-бота за своїм бажанням.
наприклад:

Привітики!
Як ся маєш?
'''
def custom_chat_bot():
    # Вітання чат-бота
    print("Привітики!")

    # Запитання про стан справ
    user_response = input("Як ся маєш? ")

    # Відповідь чат-бота
    print(f"О, як чудово! Я теж маю чудовий день! Буду знати, що {user_response}!")

# Виклик функції чат-бота
custom_chat_bot()
