'''
Вигадай діалог.
Вигадай діалог і виведи його на екран, використовуючи функцію print ().
'''
print("**Користувач:** Привіт, як справи?")

print("**Програма:** Привіт! Все гаразд, дякую. Як я можу вам допомогти сьогодні?")

print("**Користувач:** Я думаю про те, щоб вивчити програмування. З чого мені почати?")

print("**Програма:** Чудово, що ви цікавитесь програмуванням! Рекомендую розпочати з основ. Яка мова програмування вас цікавить?")

print("**Користувач:** Я не впевнений. Якщо ви можете порекомендувати, буду вдячний.")

print("**Програма:** Як початківцю, можливо, вам стане зручніше розпочати з Python. Він має простий синтаксис і використовується в різних областях. Що ви думаєте про це?")

print("**Користувач:** Слухається добре. Як я можу почати вивчати Python?")

print("**Програма:** Ви можете почати з відомого сайту Python - python.org. Там є розділ для початківців і багато ресурсів для самостійного навчання. Ще є багато онлайн-курсів і відеоуроків.")

print("**Користувач:** Дякую за пораду! Я розпочну з Python і перевірю ресурси на python.org.")

print("**Програма:** Нема за що! Бажаю успіху у вивченні програмування. Якщо вам будуть потрібні додаткові поради, не соромтеся питати.")
