'''
Напиши історю битви
Вигадай історію битви двох супергероїв та виведи її на екран, використовуючи функцію print() та метод format. Не забувай, що весь текст має бути написаний всередині потрійних лапок.
'''
battle_story = """
У світі мирного міста виникла загроза – зловісний суперзлочинець Доктор Темрява вирішив захопити владу над всією планетою.
На допомогу місту вирушив супергерой Імператор Світла, представник сил добра та справедливості.

Почалася велика битва між Імператором Світла та Доктором Темрявою. Імператор рухався з неймовірною швидкістю та випромінював яскраве світло, відштовхуючи темряву. Доктор Темрява ж, навпаки, знаходив сховища в тіні та керував силами темряви.

Протягом захоплюючої битви обидва герої використовували свої унікальні сили та прийоми. Імператор Світла відбивав атаки своїм світловим щитом, а Доктор Темрява викликав темрявину, щоб заглушити світло.

Врешті-решт, Імператор Світла зумів перемогти злочинця, засвітивши його темрявне серце своїм благородним світлом. Місто було звільнено від загрози, а Імператор Світла став справжнім героєм та захисником мирного населення.
"""

print(battle_story)


