'''
Вигадай свого супергероя.
Вигадай свого супергероя. Опиши його вміння, якості, силу, здібності і т. Д., І виведи опис на екран за допомогою функції print (). За допомогою методу format зроби опис динмічним. Не забувай, що весь текст повинен бути написаний всередині потрійних лапок.
'''
superhero_description = """
Зухвалий герой по імені Вайрлайт є останньою надією світу. Він володіє неймовірною здатністю викликати та контролювати енергію світла. 

Вміння трансформувати світло в невидимі енергетичні стріли дозволяє йому легко впоратися з будь-якою ситуацією. Вайрлайт також володіє здібністю розблоковувати та підсилювати сили інших героїв, роблячи їх непереможними.

Завдяки своїй неймовірній швидкості та гнучкості, Вайрлайт може миттєво переміщатися в будь-якій точці світу, щоб захистити тих, хто потребує допомоги. Його проникливий погляд дозволяє виявляти злочини та небезпеку, навіть на великій відстані.

Вайрлайт – символ світла та надії. Його мета - принести світло в серця всіх, кого він захищає. Він завжди готовий вступити в бій і зробити світ кращим місцем для життя.
"""

print(superhero_description)
