'''
Заведіть змінну answer і запишіть туди правильну відповідь.
Використовуйте функцію input, щоб загадати загадку користувачеві
і записати його відповідь в нову змінну.

В умовному операторі порівняйте відповідь користувача з answer. 
Якщо відповідь вірна, то привітайте користувача з правильною відповідю. 
Якщо немає - висловіть співчуття.
'''
def riddle_game():
    # Загадка
    riddle = "Що може бути світліше за день і темніше за ніч?"

    # Відповідь на загадку
    answer = "фургон"

    # Запитання користувачеві
    user_response = input(riddle + "\nТвоя відповідь: ")

    # Перевірка відповіді та виведення результату
    if user_response.lower() == answer:
        print("Вірно! Вітаємо!")
    else:
        print("Співчуваємо, це було неправильно. Правильна відповідь: " + answer)

# Виклик функції для гри в загадки
riddle_game()
