'''
!LOOPS

Напишіть програму, яка відображає таблицю перетворення температури градусів 
Цельсія і градусів Фаренгейта. 
Таблиця повинна включати рядки для всіх температур від 0 до 100 градусів Цельсія, 
кратних 10 градусам Цельсія. Додайте відповідні заголовки до стовпців. 
Формулу перекладу між градусами Цельсія і градусами Фаренгейта можна знайти в 
інтернеті.


'''
# Виведення заголовків таблиці
print("Градуси Цельсія\tГрадуси Фаренгейта")

# Цикл для температур від 0 до 100 градусів Цельсія з кроком 10
for celsius in range(0, 101, 10):
    # Обчислення градусів Фаренгейта за формулою (C * 9/5) + 32
    fahrenheit = (celsius * 9/5) + 32
    # Виведення результату у вигляді рядка
    print(f"{celsius}\t\t\t{fahrenheit}")
