'''
Напишіть програму, яка перетворює двійкове число (з основою 2) 
в десяткове (з основою 10). Ваша програма повинна починатися 
з читання двійкового числа від користувача у вигляді рядка. 
Потім слід обчислити еквівалентне десяткове число, 
обробляючи кожну цифру двійкового числа. 
Нарешті, ваша програма повинна відображати еквівалентне десяткове 
число з відповідним повідомленням.


'''
# Функція для перетворення двійкового числа в десяткове
def binary_to_decimal(binary_str):
    decimal_num = 0
    power = len(binary_str) - 1  # Ступінь числа 2

    for digit in binary_str:
        decimal_num += int(digit) * (2 ** power)
        power -= 1

    return decimal_num

# Зчитування двійкового числа від користувача
binary_input = input("Введіть двійкове число: ")

# Перетворення та виведення результату
decimal_result = binary_to_decimal(binary_input)
print(f"Десяткове представлення {binary_input} дорівнює {decimal_result}.")
