'''
Трикутник можна класифікувати, виходячи з довжин його сторін, 
на рівносторонній, рівнобедрений або прямокутний. 
Всі три сторони рівностороннього трикутника мають однакову довжину. 
Рівнобедрений трикутник має дві сторони, які мають однакову довжину, 
і третю сторону, яка має різну довжину. Якщо всі сторони мають різну довжину, 
то трикутник рівносторонній.
Напишіть програму, яка зчитує довжини трьох сторін трикутника від користувача. 
Потім відобразіть повідомлення, в якому вказано тип трикутника.

'''
# Зчитування довжин сторін трикутника від користувача
side1 = float(input("Введіть довжину першої сторони: "))
side2 = float(input("Введіть довжину другої сторони: "))
side3 = float(input("Введіть довжину третьої сторони: "))

# Перевірка типу трикутника і виведення результату
if side1 == side2 == side3:
    triangle_type = "рівносторонній"
elif side1 == side2 or side1 == side3 or side2 == side3:
    triangle_type = "рівнобедрений"
else:
    triangle_type = "різносторонній"

# Виведення результату
print(f"Трикутник є {triangle_type}.")
