'''
Напишіть програму, яка просить користувача ввести свій місяць і день народження. 
Потім ваша програма повинна повідомити знак зодіаку користувача як частину 
відповідного вихідного повідомлення.

Козеріг з 22 грудня по 19 січня
Водолій з 20 січня по 18 лютого
Риби з 19 лютого по 20 березня
Овен з 21 березня по 19 квітня
Телець з 20 квітня по 20 травня
Близнюки з 21 травня по 20 червня
Рак з 21 червня по 22 липня
Лев з 23 липня по 22 серпня
Діва з 23 серпня по 22 вересня
Терези з 23 вересня по 22 жовтня
Скорпіон з 23 жовтня по 21 листопада
Стрілець з 22 листопада по 21 грудня


'''
# Зчитування місяця та дня народження від користувача
month = input("Введіть місяць народження: ").lower()
day = int(input("Введіть день народження: "))

# Визначення знака зодіаку
if (month == "грудень" and 22 <= day <= 31) or (month == "січень" and 1 <= day <= 19):
    zodiac_sign = "Козеріг"
elif (month == "січень" and 20 <= day <= 31) or (month == "лютий" and 1 <= day <= 18):
    zodiac_sign = "Водолій"
elif (month == "лютий" and 19 <= day <= 29) or (month == "березень" and 1 <= day <= 20):
    zodiac_sign = "Риби"
elif (month == "березень" and 21 <= day <= 31) or (month == "квітень" and 1 <= day <= 19):
    zodiac_sign = "Овен"
elif (month == "квітень" and 20 <= day <= 30) or (month == "травень" and 1 <= day <= 20):
    zodiac_sign = "Телець"
elif (month == "травень" and 21 <= day <= 31) or (month == "червень" and 1 <= day <= 20):
    zodiac_sign = "Близнюки"
elif (month == "червень" and 21 <= day <= 30) or (month == "липень" and 1 <= day <= 22):
    zodiac_sign = "Рак"
elif (month == "липень" and 23 <= day <= 31) or (month == "серпень" and 1 <= day <= 22):
    zodiac_sign = "Лев"
elif (month == "серпень" and 23 <= day <= 31) or (month == "вересень" and 1 <= day <= 22):
    zodiac_sign = "Діва"
elif (month == "вересень" and 23 <= day <= 30) or (month == "жовтень" and 1 <= day <= 22):
    zodiac_sign = "Терези"
elif (month == "жовтень" and 23 <= day <= 31) or (month == "листопад" and 1 <= day <= 21):
    zodiac_sign = "Скорпіон"
elif (month == "листопад" and 22 <= day <= 30) or (month == "грудень" and 1 <= day <= 21):
    zodiac_sign = "Стрілець"
else:
    zodiac_sign = None

# Виведення результату
if zodiac_sign:
    print(f"Ваш знак зодіаку: {zodiac_sign}.")
else:
    print("Невірно введений місяць або день.")
