'''
Напишіть програму, яка починається з читання буквеної оцінки від користувача. 
Потім ваша програма повинна обчислити та відобразити еквівалентну кількість 
балів оцінок. Переконайтеся, що програма створює відповідне повідомлення 
про помилку, якщо користувач вводить неприпустиму оцінку букв.

'''
# Зчитування буквеної оцінки від користувача
letter_grade = input("Введіть буквену оцінку: ").upper()

# Визначення еквівалентної кількості балів
if letter_grade == "A":
    points = 4.0
elif letter_grade == "B":
    points = 3.0
elif letter_grade == "C":
    points = 2.0
elif letter_grade == "D":
    points = 1.0
elif letter_grade == "F":
    points = 0.0
else:
    points = None

# Виведення результату
if points is not None:
    print(f"Еквівалентна кількість балів: {points}")
else:
    print("Невірно введена буквена оцінка.")
