'''
Вільний діалог

Вільне завдання: вигадайте свою програму, яка задає питання і коментує відповіді.
Можна, наприклад, написати програму-анкету, яка запитує дані людини: ім'я, прізвище, вік, улюблені колір 
і страву і т. д., а потім друкує табличку типу 
"Ім'я: (ім'я людини)". 
"Прізвище: (введене прізвище)" 
і т. д.            
                                                                                  
А можна придумати смішний діалог. 
Запропонуйте друзям поговорити з цією програмою!
'''
# Програма-анкета

# Запитання та збір відповідей від користувача
name = input("Як вас звати? ")
surname = input("Введіть ваше прізвище: ")
age = input("Скільки вам років? ")
color = input("Який ваш улюблений колір? ")
food = input("Яка ваша улюблена страва? ")

# Виведення результатів
print("\nАнкета:")
print("Ім'я:", name)
print("Прізвище:", surname)
print("Вік:", age)
print("Улюблений колір:", color)
print("Улюблена страва:", food)

# Коментар
print("\nЦікаві відповіді! Спасибі за відповіді!")
